/************************************************************************************
简要描述：分列整齐地显示整数1到10的2至5次幂。
*************************************************************************************/
#include<stdio.h>
double  power(int,int);  /*  函数原型 */

int  main(void)
{
	    int  i, j;
        /*  显示表头  */
	    printf("\n%5s%10s%10s%10s%10s\n","Int","Square","Cube","Quartic","Quintic");

	    /* 分列整齐地显示整数1到10的2至5次幂 */
        for(i=1;i<=10;i++)
        {
           printf("%5d",i);
		   for(j=2;j<=5;j++)
			     printf("%10.0f", power(i,j));
		   printf("\n");
		}
		return 0;
}

/****************************************************************
函数名称：power
函数功能：计算x的n次方
函数参数：第1个参数x为int，第2个参数n也为int
函数返回值：返回x的n次方，为避免溢出，将函数值的类型说明为double。
****************************************************************/
double  power(int x, int n)
{
	    int  i;
	    double  p;
	    for (i=1,p=1;i<=n;i++)
	          p*=x;
	    return  p;
}
