/************************************************************************************
 简要描述：计算 1!+2!+3!+4!+…n!。
*************************************************************************************/
#include<stdio.h>
long  fac(int);          /* 函数原型 */
int  main(void)
{
  int  i,n;
  long sum=0;
  printf("input n(n>0):\n");
  scanf("%d",&n);
  for(i=1;i<=n;i++)
       sum+=fac(i);
  printf("1!+2!+..+%d!=%ld\n",n,sum);
  return 0;
}

/****************************************************************
函数名称：fac
函数功能：利用静态局部变量的特性求一个整数的阶乘。
函数参数：形参n是int型
函数返回值：返回n的阶乘，类型long
*****************************************************************/
long  fac(int  n)
{
  static  long f=1;     /* 静态局部变量 */
  f *=n;
  return f;
}
