/************************************************************************************
简要描述：显示int型数据的每一个二进制位，以查明在内存中如何表示表达式的值。
*************************************************************************************/
#include<stdio.h>
#include<limits.h>
/****************************************************************
函数名称：PrintBit
函数功能：显示int型数据的每一个二进制位
函数参数：参数x为int，表示待显示的整数
函数返回值：无
****************************************************************/
void PrintBit(int x)
{
	int  i;
	int  n=sizeof(int) * CHAR_BIT;       /* CHAR_BIT 在limits.h中定义 */
	int  mask = 1 << (n-1);              /* 逻辑尺mask=100……0 */
	for(i=1;i<=n;++i)
	{
		putchar ( ! ( x & mask ) ? '0': '1');
		x<<=1;
		if ( ! ( i % CHAR_BIT ) && i<n )
		     putchar(' ');
	}
}

int main()
{
	PrintBit(15);
	return 0;
}
