/************************************************************************************
简要描述：回溯法解填字游戏。
*************************************************************************************/
#include<stdio.h> 
# define N 12 
void output(int a[]);
int isprime(int m);
int check(int pos);

/*  9行3列的数组，存放与每个方格相邻的方格编号 */
int checkmatrix[ ][3]={ {-1}, {0,-1},   {1,-1},
	{0,-1}, {1,3,-1}, {2,4,-1},	{3,-1}, {4,6,-1}, {5,7,-1}};
int tag[N+1]; /* 标记某个整数是否被用过，如 i被用过，则tag[i]=0 */
int a[9];     /* 表示3*3的方阵 */
void BackTrack(int pos);

int main(void) 
{
	int i;
	for (i=1;i<=N;i++) 
		tag[i]=1;
	BackTrack(0);            
	return 0;
}

/************************************************************************************
函数名称：output
函数功能：输出一个解
函数参数：a--存放解的数组
函数返回值：无
***********************************************************************************/
void output(int a[]) 
{ 
	int i,j; 
    for (i=0;i<3;i++) 
	{ 
		for (j=0;j<3;j++)
			printf("%5d",a[3*i+j]); 
		printf("\n"); 
	} 
	printf("\n\n"); 
	
} 

/************************************************************************************
函数名称：isprime
函数功能：判素数
函数参数：m--待判整数
函数返回值：m是素数，返回1，不是，返回0。
************************************************************************************/
int isprime(int m) 
{
	int i; 
	if(m==2) return 1;
	if (m==1||m%2==0)	return 0; 
	for (i=2;i*i<=m;i++) 
	{
		if(!(m%i)) 	return 0; 
	} 
	return 1;
}
 
/************************************************************************************
函数名称：check
函数功能：检查当前位置填放的有效性
函数参数：pos--方格编号
函数返回值：无
************************************************************************************/
int check(int pos) 
{ 
	int i,j;  
	for (i=0;(j=checkmatrix[pos][i])>=0;i++) 
		if (!isprime(a[pos]+a[j])) 
			return 0; 
		return 1; 
} 

/************************************************************************************
函数名称：BackTrack
函数功能：填字游戏的回溯算法。在第pos个方格放一个数。 
函数参数：pos, 方格编号。
函数返回值：无。
************************************************************************************/	 
void BackTrack(int pos)  
{  
  int i;
  if(pos>=9)  /* 递归边界：已放了9个数  */ 
  {               
    output(a);/* 输出一个可行解 */
  }
  else  /* 否则，还未放到9个数，继续放 */  
    for(i=1;i<=N;i++)  {
		if(tag[i]){    /*未用过*/
			a[pos]=i; 
			tag[i]=0;
			if(check(pos))  /*  合法  */
				BackTrack(pos+1);
			tag[i]=1;
		}
	}
}
