#include<stdio.h>
#define N 10  /*地窖数*/

struct node getf(int i);
int solve(void);
void PrintPath(int k);

struct node  
{
	int sum;  /*从当前节点出发最多挖出的地雷数*/
	int next;  /* 下一个点的编号*/
};

struct node  f[N]; /* 问题的解*/ 

int w[N]={8,14,2,17,33,26,15,17,19,6}; /* 地窖的地雷数*/
int a[N][N]={  /*地窖的链接矩阵,1:有通路，0:无通路*/
	{0,0,1,1,0,0,0,0,0,0},
	{0,0,1,0,0,0,1,0,0,0},
	{0,0,0,0,0,1,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,1,0,0,0,0},
	{0,0,0,0,0,0,1,0,0,0},
	{0,0,0,0,0,0,0,1,0,0},
	{0,0,0,0,0,0,0,0,0,1},
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0}
};  

void main()
{
	int i,max;

    for(i=0;i<N;i++)/*初始化*/
	{
		f[i].sum=-1;
        f[i].next=0; 
	}
    max=solve();
	PrintPath(max);
}

/****************************************************************
函数名称：getf
函数功能： 用递归法计算“从第i个地窖开始最多可以挖出的地雷数”及
           下一个点的编号,并存于数组元素f[i]。
函数参数：i-- 起始地窖编号
函数返回值：返回f[i]
****************************************************************/
struct node getf(int i)
{
	int k,max,t,j;
	if(f[i].sum>=0)  /* 已被计算过，避免重复 */
		return f[i];  
	if(i==N-1) /* 最终返回点 */
	{
		f[i].sum=w[i];
		return f[i];
	}
	k=0,max=0;       /* 找大的和记下标位置 */
	for(j=i+1;j<=N-1;j++)   /* 从前向后挖  */
	{
		if((a[i][j]==1)&&((t=getf(j).sum)>max))  
		{   /* 有路且地雷数多 */
			max=t;    /*记下最大值 */
			k=j;      /*记下标 */
		}
	}
	f[i].sum=max+w[i];  /*第i个地窖的最大地雷数*/
	f[i].next=k;        /*记下后继挖最大的地雷数的路径*/
	return f[i];
}

/****************************************************************
函数名称：solve
函数功能： 求解挖地雷问题的最大值
函数参数：无
函数返回值：返回挖到最多地雷的起始的地窖编号
****************************************************************/
int solve()
{
	int k,max=0,i;
    for(i=0;i<=N-1;i++)
		getf(i);
	for(i=0;i<N;i++)
		if(f[i].sum>max)  {
           max=f[i].sum; /*记下最大数*/
           k=i;/*记下标*/
         }
	return k;
}
/****************************************************************
函数名称：PrintPath
函数功能：输出最优解的路径
函数参数：k--起始的地窖编号
函数返回值：无
****************************************************************/
void PrintPath(int k)
{
	int j;
	printf("\n挖地雷的顺序:\n");
	printf("%d",k+1);
    j=f[k].next;/*K的后继地窖点的序号 */
    while(j!=0) 
	{
          printf("--->%d",j+1);
          j=f[j].next;/*找下一个后继地窖点的序号*/
	}
	putchar('\n');
	printf("\n挖地雷的数量:%d\n",f[k].sum);	
}